#include <filesystem>
#include <locale>
#include <string>
#include <thread>
#include <iostream>
#include <sstream>
#include <windows.h>
#include <MinHook.h>
#include <fstream>
#include <nlohmann/json.hpp>

#include <vector>
#include <map>
#include <unordered_map>

#include <jsoncons/json.hpp>
#include <jsoncons_ext/msgpack/msgpack.hpp>

#include "dirent.h"

#include "edb.hpp"
#include "responses.hpp"
#include "mdb.hpp"
#include "il2cpp_symbols.hpp"

#include "imgui/imgui.h"
#include "imgui/imgui_impl_win32.h"
#include "imgui/imgui_impl_dx11.h"

#include <d3d11.h>
#include <tchar.h>


#include "imgui/imgui.h"
#include "imgui/imgui_impl_win32.h"
#include "imgui/imgui_impl_dx11.h"
#include <d3d11.h>
#include <tchar.h>

#include "parallel_hashmap/phmap.h"

using phmap::flat_hash_map;


using namespace std;
using namespace std::literals;

#pragma region GlobalValueDefine
using njson = nlohmann::json;
using namespace jsoncons;

extern LPVOID copysheet;
extern LPVOID getfield_addr;
extern bool first;

bool first = true;
LPVOID copysheet = 0;
LPVOID getfield_addr;

int cid = 0;
int sid = 0;
int gd = 0;
char str_cid[100];
char str_sid[100];
char str_gd[100];

void* test;

int global_story_id;
int global_chara_id;

int global_fps = 60;
char file_fps[100];
int temp_fps = 60;

static void* Global_ProInfo;
static void* namePro;

static vector<pair<int, string>> umaList;
static flat_hash_map<int, pair<bool, bool>> selected_uma_id;
static flat_hash_map<int, std::vector<int>> chara_story;

static bool is_enable_chara = false;
static bool is_live_bypass = true;
static bool auto_fullscreen = true;

std::map<int, std::pair<int, int>> homeStandConvert{};
int tmpAddId, tmpTargetId, tmpTargetCloth;

static void* selectedMoveObj;

#define WSTR2( s ) L##s
#define WSTR( s ) WSTR2( s )

#define ADD_HOOK(_name_, _fmt_) \
	auto _name_##_offset = reinterpret_cast<void*>(_name_##_addr); \
	printf(_fmt_, _name_##_offset); \
	MH_CreateHook(_name_##_offset, _name_##_hook, &_name_##_orig); \
	MH_EnableHook(_name_##_offset); 

int imguiwindow();
#pragma endregion

#pragma region StructDefine
struct Matrix4x4 // TypeDefIndex: 2062
{
	float m00; // 0x0
	float m10; // 0x4
	float m20; // 0x8
	float m30; // 0xC
	float m01; // 0x10
	float m11; // 0x14
	float m21; // 0x18
	float m31; // 0x1C
	float m02; // 0x20
	float m12; // 0x24
	float m22; // 0x28
	float m32; // 0x2C
	float m03; // 0x30
	float m13; // 0x34
	float m23; // 0x38
	float m33; // 0x3C
};

struct Vector3 // TypeDefIndex: 2063
{
	float x; // 0x0
	float y; // 0x4
	float z; // 0x8
};

struct Vector2 // TypeDefIndex: 2063
{
	float x; // 0x0
	float y; // 0x4
};

struct Quaternion // TypeDefIndex: 2064
{
	// Fields
	float x; // 0x0
	float y; // 0x4
	float z; // 0x8
	float w; // 0xC
};

struct FacialDataUpdateInfo // TypeDefIndex: 16768
{
	// Fields
	LPVOID faceCur; // 0x0
	LPVOID faceNext; // 0x8
	LPVOID mouth; // 0x10
	LPVOID eyeCur; // 0x18
	LPVOID eyeNext; // 0x20
	LPVOID eyebrow; // 0x28
	LPVOID eyeTrack; // 0x30
	LPVOID ear; // 0x38
	LPVOID effect; // 0x40
	int faceKeyIndex; // 0x48
	int mouthKeyIndex; // 0x4C
	int eyeKeyIndex; // 0x50
	int eyebrowKeyIndex; // 0x54
	int eyeTrackKeyIndex; // 0x58
	int earKeyIndex; // 0x5C
	int effectKeyIndex; // 0x60
};

struct LiveTimelineWorkSheet // TypeDefIndex: 17060
{
	// Fields
	LPVOID VersionList; // 0x0
	LPVOID unknown1; //0x08
	LPVOID unknown2; //0x10
	LPVOID version; // 0x18
	int targetCameraIndex; // 0x20
	bool enableAtRuntime; // 0x24
	bool enableAtEdit; // 0x25
	short unknown3; //0x26
	float TotalTimeLength; // 0x28
	bool Lyrics; // 0x2C
	char unknown4; //0x2D
	short unknown5; //0x2E
	LPVOID SheetType; // 0x30
	LPVOID timescaleKeys; // 0x38
	LPVOID cameraPosKeys; // 0x40
	LPVOID cameraLookAtKeys; // 0x48
	LPVOID cameraFovKeys; // 0x50
	LPVOID cameraRollKeys; // 0x58
	LPVOID cameraMotionKeys; // 0x60
	LPVOID handShakeCameraKeys; // 0x68
	LPVOID eventKeys; // 0x70
	LPVOID charaMotSeqList; // 0x78
	LPVOID bgColor1List; // 0x80
	LPVOID bgColor2List; // 0x88
	LPVOID monitorControlList; // 0x90
	LPVOID animationList; // 0x98
	LPVOID textureAnimationList; // 0xA0
	LPVOID transformList; // 0xA8
	LPVOID rendererList; // 0xB0
	LPVOID objectList; // 0xB8
	LPVOID waveObjectList; // 0xC0
	LPVOID audienceList; // 0xC8
	LPVOID propsList; // 0xD0
	LPVOID propsAttachList; // 0xD8
	LPVOID cameraSwitcherKeys; // 0xE0
	LPVOID ripSyncKeys; // 0xE8
	LPVOID ripSync2Keys; // 0xF0
	LPVOID postEffectDOFKeys; // 0xF8
	LPVOID postEffectBloomDiffusionKeys; // 0x100
	LPVOID radialBlurKeys; // 0x108
	LPVOID postFilmKeys; // 0x110
	LPVOID postFilm2Keys; // 0x118
	LPVOID postFilm3Keys; // 0x120
	LPVOID FluctuationKeys; // 0x128
	LPVOID VortexKeys; // 0x130
	LPVOID fadeKeys; // 0x138
	LPVOID cameraLayerKeys; // 0x140
	LPVOID projecterList; // 0x148
	LPVOID facial1Set; // 0x150
	LPVOID other4EyeTrackKeys; // 0x158
	LPVOID ToneCurveKeys; // 0x160
	LPVOID ExposureKeys; // 0x168
	LPVOID other4FacialArray; // 0x170
	LPVOID facialNoiseKeys; // 0x178
	LPVOID charaMotionNoiseKeys; // 0x180
	LPVOID formationOffsetSet; // 0x188
	LPVOID volumeLightKeys; // 0x190
	LPVOID hdrBloomKeys; // 0x198
	LPVOID particleList; // 0x1A0
	LPVOID particleGroupList; // 0x1A8
	LPVOID WashLightList; // 0x1B0
	LPVOID laserList; // 0x1B8
	LPVOID blinkLightList; // 0x1C0
	LPVOID uvScrollLightList; // 0x1C8
	LPVOID facialToonSet; // 0x1D0
	LPVOID globalLightDataLists; // 0x1D8
	LPVOID globalFogDataLists; // 0x1E0
	LPVOID colorCorrectionDataLists; // 0x1E8
	LPVOID lightShaftsKeysLine; // 0x1F0
	LPVOID monitorCameraPosKeys; // 0x1F8
	LPVOID monitorCameraLookAtKeys; // 0x200
	LPVOID multiCameraPosKeys; // 0x208
	LPVOID multiCameraLookAtKeys; // 0x210
	LPVOID lensFlareList; // 0x218
	LPVOID environmentDataLists; // 0x220
	LPVOID sweatLocatorList; // 0x228
	LPVOID effectList; // 0x230
	LPVOID tiltShiftKeys; // 0x238
	LPVOID a2uConfigList; // 0x240
	LPVOID a2uList; // 0x248
	LPVOID titleKeys; // 0x250
	LPVOID spotlight3dList; // 0x258
	LPVOID nodeScaleList; // 0x260
	LPVOID charaFootLightKeys; // 0x268
	LPVOID chromaticAberrationList; // 0x270
	LPVOID lightProjectionList; // 0x278
	LPVOID billboardList; // 0x280
	LPVOID postFilm1MultiCameraKeys; // 0x288
	LPVOID postEffectBloomDiffusionMultiCameraKeys; // 0x290
	LPVOID multiCameraColorCorrectionDataLists; // 0x298
	LPVOID multiCameraTiltShiftDataLists; // 0x2A0
	LPVOID multiCameraRadialBlurDataLists; // 0x2A8
	LPVOID postEffectDOFMultiCameraKeys; // 0x2B0
	LPVOID AdditionalLightList; // 0x2B8
	LPVOID MultiLightShadowKeys; // 0x2C0
	LPVOID MobControlKeys; // 0x2C8
	LPVOID CyalumeControlKeys; // 0x2D0
	LPVOID charaWind; // 0x2D8
	LPVOID CharaPartsKeys; // 0x2E0
	LPVOID EyeCameraPosList; // 0x2E8
	LPVOID EyeCameraLookAtList; // 0x2F0
	LPVOID _keysArray; // 0x2F8
};

struct RaceResultCutInHelper
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	LPVOID unknown3; //0x10
	LPVOID _timelineController; // 0x18
	LPVOID _onRenderImageEffect; //0x20
	LPVOID _loadedPath; //0x28
	LPVOID _sound; //0x30
	LPVOID OnStartAction; //0x38
	LPVOID OnEndAction; //0x40
	LPVOID OnGetCharaIdAction; //0x48
	LPVOID GetUserModelControllerAction; //0x50
	LPVOID OnPreSetupCharacterModelAction; //0x58
	LPVOID OnCreateAfterCharacterModelAction; //0x60
	LPVOID OnGetLoadedBackGroundAction; //0x68
	LPVOID _keepGlobalToonColor; //0x70
	LPVOID unknown4; //0x78
	LPVOID _characterRenderOrder; //0x80
	LPVOID _characterModelInstanceList; //0x88
	LPVOID _characterList; //0x90
	LPVOID TrainingBgChildDic; //0x98
	LPVOID _motionSwapController; //0xA0
	LPVOID _cyspringControlTargetController; //0xA8
	LPVOID ChildCutInHelperList; // 0xB0
	LPVOID _tempLoadPath; // 0xB8
	LPVOID _tempParent; // 0xC0
	LPVOID _isPlayedFixedUpdateForHighSpeed; // 0xC8
	LPVOID _preInstantiateInfo; // 0xD0
	LPVOID _cachedObjectRoot; // 0xD8
	LPVOID unknown5; //0xE0
	LPVOID _effectCamera; // 0xE8
	LPVOID _multiCameraDepthIndex; // 0xF0
	LPVOID _monitorInfoList; // 0xF8
	LPVOID _monitorRenderTexture; // 0x100
	LPVOID _loadedResourceDic; // 0x108
	LPVOID _cameraObject; // 0x110
	LPVOID _modelControllerArray; // 0x118
	LPVOID _courseBillboardBoundArray; // 0x120
	LPVOID _cameraMotionClip; // 0x128
	LPVOID _characterMotionClip; // 0x130
	LPVOID _facialDriven; // 0x138
	LPVOID _earDriven; // 0x140
	LPVOID _clipPlane; // 0x148
	LPVOID _playIndex; // 0x150
	LPVOID  _timelineCharacter; // 0x158
	LPVOID  _frameBuffer; // 0x160
	LPVOID _onPreCull; // 0x168
	LPVOID _onPostRender; // 0x170
	LPVOID _maskArray; // 0x178
	LPVOID _characterEnvParam; // 0x180
	LPVOID _courseEnvParam; // 0x188
	LPVOID _cacheMyTransform; // 0x190
	LPVOID _cacheCameraTransform; // 0x198
	LPVOID  _prefabRendererList; // 0x1A0
	LPVOID _charaPropList; // 0x1A8
	LPVOID _toBackgroundCameraRenderTexture; // 0x1B0
	LPVOID _uiImageCommandBuffer; // 0x1B8
};

struct RaceSkillCutInHelper
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	LPVOID unknown3; //0x10
	LPVOID _timelineController; // 0x18
	LPVOID _onRenderImageEffect; //0x20
	LPVOID _loadedPath; //0x28
	LPVOID _sound; //0x30
	LPVOID OnStartAction; //0x38
	LPVOID OnEndAction; //0x40
	LPVOID OnGetCharaIdAction; //0x48
	LPVOID GetUserModelControllerAction; //0x50
	LPVOID OnPreSetupCharacterModelAction; //0x58
	LPVOID OnCreateAfterCharacterModelAction; //0x60
	LPVOID OnGetLoadedBackGroundAction; //0x68
	LPVOID _keepGlobalToonColor; //0x70
	LPVOID unknown4; //0x78
	LPVOID _characterRenderOrder; //0x80
	LPVOID _characterModelInstanceList; //0x88
	LPVOID _characterList; //0x90
	LPVOID TrainingBgChildDic; //0x98
	LPVOID _motionSwapController; //0xA0
	LPVOID _cyspringControlTargetController; //0xA8
	LPVOID ChildCutInHelperList; // 0xB0
	LPVOID _tempLoadPath; // 0xB8
	LPVOID _tempParent; // 0xC0
	LPVOID _isPlayedFixedUpdateForHighSpeed; // 0xC8
	LPVOID _preInstantiateInfo; // 0xD0
	LPVOID _cachedObjectRoot; // 0xD8
	LPVOID unknown5; //0xE0
	LPVOID _effectCamera; // 0xE8
	LPVOID _multiCameraDepthIndex; // 0xF0
	LPVOID _monitorInfoList; // 0xF8
	LPVOID _monitorRenderTexture; // 0x100
	LPVOID _loadedResourceDic; // 0x108
	LPVOID _baseHorseInfo; // 0x110
	LPVOID _onGetHorseIndex; // 0x118
	LPVOID _onGetSubKey; // 0x120
	LPVOID _raceManager; // 0x128
	LPVOID _onCheckPrefabTimeline; // 0x130
	LPVOID _charaColor1; // 0x138
	LPVOID _charaColor2; // 0x140
	LPVOID _charaSubColor1; // 0x148
	LPVOID _charaSubColor2; // 0x150
	LPVOID _assetReferenceTable; // 0x158
	LPVOID _preInstantiatedFixedCharaInfoList; // 0x160
	LPVOID _preInstantiatedUserCharaInfoList; // 0x168
	LPVOID _getFlashPlayerAction; // 0x170
	LPVOID _isEnablePlayFlash; // 0x178
	LPVOID _onSetWaitTap; // 0x180
	LPVOID _onSetTapJumpFrame; // 0x188
	LPVOID _onGachaGateAction; // 0x190
	LPVOID _onPlayVoice; // 0x198
	LPVOID _onSetWaitVoiceEnd; // 0x1A0
	LPVOID _onSimpleCommand; // 0x1A8
	LPVOID _onPlayEnv; // 0x1B0
	LPVOID _onSetVolumeEnv; // 0x1B8
	LPVOID _frameBuffer; // 0x1C0
	LPVOID _owner; // 0x1C8
	LPVOID _isBGMVolumeFade; // 0x1D0
	LPVOID _backgroundCommandBuffer; // 0x1D8
	LPVOID _uiImageCommandBuffer; // 0x1E0
	LPVOID _addLight; // 0x1E8
	LPVOID _lightRoot; // 0x1F0
	LPVOID _multiLightShadowController; // 0x1F8
	LPVOID _isInitializeShadowController; // 0x200
	LPVOID _backGroundCamera; // 0x208
	LPVOID _consignedCameraRootObj; // 0x210
	LPVOID _frameBufferAddedCameraList; // 0x218
	LPVOID _toCutInCameraRenderTexture; // 0x220
	LPVOID _toBackgroundCameraRenderTexture; // 0x228
	LPVOID _limitBrealTempDataList; // 0x230
	LPVOID _envPlayback; // 0x238

};

struct umastring
{
	LPVOID Empty; //0x00
	LPVOID unknown1; //0x08
	LPVOID m_stringLength; //0x10
	char m_firstChar; // 0x14
};

struct umachar
{
	LPVOID unknown1;
	LPVOID unknown2;
	LPVOID unknown3;
	long long length;
	short charstart;
};

struct CharacterSystemText
{

	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	int CharacterId; // 0x10
	int VoiceId; // 0x14
	LPVOID Text; // 0x18
	LPVOID CueSheet; // 0x20
	int CueId; // 0x28
	int MotionSet; // 0x2C
	int Scene; // 0x30
	int UseGallery; // 0x34
	int CardId; // 0x38
	int unknown3; // 0x3C
	LPVOID LipSyncData; // 0x40
	int Gender; // 0x48
	int MotionSecondSet; // 0x4C
	int MotionSecondStart; // 0x50
	int unknown4; // 0x54
	long long StartDate; // 0x58
	LPVOID _cueSheetString; // 0x60

};


struct CutInCharacterCreateInfo
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	int _characterType; // 0x10
	int _charaIndex; // 0x14
	LPVOID _parent; // 0x18
	int _charaId; // 0x20
	int _clothId; // 0x24
	int _headId; // 0x28
	int IsUseDressDataHeadModelSubId; // 0x2C
	int _zekkenNo; // 0x30
	bool _isWet; // 0x34
	bool _isDirt; // 0x35
	short unknown3; // 0x36
	int OverrideClothCategory; // 0x38
};

struct CutInCharacter
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	CutInCharacterCreateInfo* _createInfo; // 0x10
	LPVOID _createType; // 0x18
	LPVOID _model; // 0x20
	LPVOID _ikController; // 0x28
	LPVOID _isAddIKControllerFromCutIn; // 0x30
	LPVOID  _sweatController; // 0x38
	LPVOID _animator; // 0x40
	LPVOID _isCreateAnimator; // 0x48
	LPVOID _modelRendererHolder; // 0x50
	LPVOID _footShadowController; // 0x58
	LPVOID __isAddFootShadowController; // 0x60
	LPVOID _eyeTraceController; // 0x68
	LPVOID _emissiveScrollList; // 0x70
	LPVOID _cutInMode; // 0x78
	LPVOID _cachedPos; // 0x80
	int unknown3; //0x88
	LPVOID _cachedRot; // 0x8C
	LPVOID unknown4; // 0x94
	LPVOID _cachedScale; // 0x9C
	int unknown5; //0xA4
	int k__BackingField; // 0xA8
	int _originClothCategory; // 0xAC
};

struct CharacterBuildInfo
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	int _cardId; // 0x10
	int _charaId; // 0x14
	int _mobId; // 0x18
	int _headModelSubId; // 0x1C
	int _isUseDressDataHeadModelSubId; // 0x20
	int _bodyModelSubId; // 0x24
	int _dressId; // 0x28
	int _controllerType; // 0x2C
	int _zekken; // 0x30
	int unknown3; //0x34
	LPVOID _name; // 0x38
	int _genderType; // 0x40
	int _heightType; // 0x44
	int _bodySize; // 0x48
	int _bustType; // 0x4C
	int _height; // 0x50
	int _skinType; // 0x54
	int _socksType; // 0x58
};

struct TimelineKeyCharacterDataList
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	LPVOID unknown3; //0x10
	LPVOID unknown4; //0x18
	LPVOID unknown5; //0x20
	LPVOID unknown6; //0x28
	LPVOID unknown7; //0x30
	LPVOID unknown8; //0x38
	LPVOID unknown9; //0x40
	int _selectCharaId; //0x48
	int _selectClothId; // 0x4C
	int _selectHeadId; // 0x50
};

struct TimelineCharacterGroupData
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	LPVOID _types; // 0x10
	LPVOID _chara; // 0x18
	int _characterColorNum; // 0x20
	int CharacterWindNum; // 0x24
	int _characterShadowNum; // 0x28
	int _characterFootSmokeNum; // 0x2C
	int _characterSweatNum; // 0x30
	int _characterCollisionNum; // 0x34
	int CharacterSpringCollisionNum; // 0x38
	int _characterIKNum; // 0x3C
	int CharacterPartsNum; // 0x40
	int unknown3; //0x44
	TimelineKeyCharacterDataList* _characterKeys; // 0x48
};

struct TimelineCharacter
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	LPVOID _controller; // 0x10
	TimelineCharacterGroupData* _data; // 0x18
	LPVOID _transformObject; // 0x20
	LPVOID _transform; // 0x28
	LPVOID _animation; // 0x30
	int _motionTriggeredKeyIndex; // 0x38
	int _selectCharaId; // 0x3C
	int _selectClothId; // 0x40
	int _selectHeadId; // 0x44
	int _isUseDressDataHeadModelSubId; // 0x48
	int _charaIndex; // 0x4C
	LPVOID _animator; // 0x50
	CutInCharacter* _cutInCharacter; // 0x58
};

struct Owner
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	int HorseIndex; // 0x10
	int SubKey; // 0x14
	int CharaId; // 0x18
	int CardId; // 0x1C
	LPVOID FrameBuffer; // 0x20
	int IsReadyJumpFrame; // 0x28
	int JumpFrame; // 0x2C
	bool IsJumpedFrame; // 0x30
	bool IsWaitVoiceEnd; // 0x31
	short unknown3; // 0x32
	int WaitTapFrame; // 0x34
};

struct GachaMainViewController
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	LPVOID unknown3; //0x10
	LPVOID unknown4; //0x18
	LPVOID unknown5; //0x20
	LPVOID unknown6; //0x28
	LPVOID _viewInfo; // 0x30
	bool _isSkipAct; // 0x38
	bool _isNextCut; // 0x39
	bool _isRequestedChangeView; // 0x3A
	bool unknown7; //0x3B
	int unknown8; //0x3C
	LPVOID _rootObj; // 0x40
	LPVOID _context; // 0x48
	LPVOID _cutList; // 0x50
	LPVOID _playingIndex; // 0x58
	LPVOID _soundLoadCharaIdsGacha; // 0x60
	LPVOID _soundLoadSeCueSheetList; // 0x68
	LPVOID _cardBGCamera; // 0x70
	LPVOID _cardCamera; // 0x78
	LPVOID _cardCameraTrs; // 0x80
	LPVOID _isLockGameCanvas; // 0x88
};

struct MoveNext
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	LPVOID state; // 0x10
	LPVOID current; // 0x18
	GachaMainViewController* _this; // 0x20
	int cardCount; // 0x28
	int cutCount; // 0x2C
	int index; // 0x30
};

struct ReservedCutIn
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	int InstanceNum; // 0x10
	int HorseIndex; // 0x14
	LPVOID CutInName; // 0x18
	int Category; // 0x20
	int SkillId; // 0x24
	float Time; // 0x28
	bool IsBGMVolumeFade; // 0x2C
};

struct GachaCutInR3SkillCutIn
{
	LPVOID unknown1; //0x00
	LPVOID unknown2; //0x08
	LPVOID Something_bool; // 0x10
	LPVOID _context; // 0x18
	LPVOID _isDisableBgObject; // 0x20
	LPVOID Info; // 0x28
	int _startFrame; // 0x30
	int _subKey; // 0x34
	LPVOID _namePlate; // 0x38
	LPVOID _se; // 0x40
};

struct ObjectTree
{
	string name;
	void* gameObj;
	int instanceID;
	vector<void*> components;
	vector<void*> children;
	bool activeSelf;
	bool activeInHierarchy;
};

struct ObjectWindowInfo
{
	void* obj;
	void* _class;
	bool state;
	string name;
	string typeName;
};

struct ArrayWindowInfo
{
	void* obj;
	bool state;
	string typeName;
};

struct ObjectProInfo
{
	void* type;
	vector<void*> properties;
	int proLength;
	vector<string> propertyNameList;
};
#pragma endregion

namespace
{
#pragma region HookFunction
	void create_debug_console()
	{
		AllocConsole();

		FILE* _;
		// open stdout stream
		freopen_s(&_, "CONOUT$", "w", stdout);
		freopen_s(&_, "CONOUT$", "w", stderr);
		freopen_s(&_, "CONIN$", "r", stdin);

		SetConsoleTitle(L"Umapyoi");

		// set this to avoid turn japanese texts into question mark
		SetConsoleOutputCP(CP_UTF8);
		std::locale::global(std::locale(""));
	}

	std::string current_time()
	{
